HW3/rottenpotatoes/app/controllers/movies_controller.rb

  def index
    sort = params[:sort]
    head_class = params[:id]
    @all_ratings = ['G','PG','PG-13','R','NC-17']
    @selected_ratings = params[:ratings] || {'G'=>'1','PG'=>'1','PG-13'=>'1','R'=>'1','NC-17'=>'1'}

    case sort
    when "title"
      ordering = {:order => :title}
      @title_header = "hilite"
    when "release_date"
      ordering = {:order => :release_date}
      @date_header = "hilite"
    end
    #@movies = Movie.all
    @movies = Movie.find_all_by_rating(@selected_ratings.keys,ordering)
---
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'PG-13') ORDER BY release_date

  def sort
    @sort_method = params[:sort_method]
    @movies = Movie.order(@sort_method)
---
SELECT "movies".* FROM "movies" ORDER BY rating